{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Aviation",
    "1": "Business_and_Economy_Loss",
    "2": "Contamination_of_Water_Sources",
    "3": "Damage_to_Buildings",
    "4": "Debris_Induced",
    "5": "Drowning_Induced",
    "6": "Electrocution",
    "7": "Evacuation",
    "8": "Falling_Trees",
    "9": "Lightning",
    "10": "Mental_Health_Issues",
    "11": "Oil_Industry_Impact",
    "12": "Power_Outage_Gas_and_Heating",
    "13": "Road_Transportation_Damage",
    "14": "Shipping_Industry_Impact",
    "15": "Wildlife_Induced",
    "16": "Impact_on_Aviation_Sector"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Aviation": 0,
    "Business_and_Economy_Loss": 1,
    "Contamination_of_Water_Sources": 2,
    "Damage_to_Buildings": 3,
    "Debris_Induced": 4,
    "Drowning_Induced": 5,
    "Electrocution": 6,
    "Evacuation": 7,
    "Falling_Trees": 8,
    "Impact_on_Aviation_Sector": 16,
    "Lightning": 9,
    "Mental_Health_Issues": 10,
    "Oil_Industry_Impact": 11,
    "Power_Outage_Gas_and_Heating": 12,
    "Road_Transportation_Damage": 13,
    "Shipping_Industry_Impact": 14,
    "Wildlife_Induced": 15
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
